const rawData = [
  { server: "集结·天使1服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:3,price:3},
      {n:"冰火之泉",q:123,price:0.1},
      {n:"唐门淬火石宝箱",q:21,price:0.3},
      {n:"昊天令礼包",q:105,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:5,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:4,price:1.5},
      {n:"蓝银之种",q:46,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:7},
      {n:"雪茄选择宝箱（2605）",q:29}
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:1},
      {n:"星神剑魂宝箱",q:3},
      {n:"死之乐章宝箱",q:6},
      {n:"真龙骨骼宝箱",q:1},
      {n:"龙纹琉璃宝箱",q:1}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:1},
      {n:"剑痴领域宝箱",q:19},
      {n:"天梦领域宝箱",q:10},
      {n:"极冰领域宝箱",q:36},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:11}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:1},
      {n:"剑痴领域宝箱",q:19},
      {n:"天梦领域宝箱",q:10},
      {n:"极冰领域宝箱",q:36},
      {n:"死之乐章宝箱",q:6},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:11}
    ]}
  ]},
  { server: "周年·黄金天使2服", group: "天使周年", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:11,price:3},
      {n:"冰火之泉",q:414,price:0.1},
      {n:"唐门淬火石宝箱",q:111,price:0.3},
      {n:"昊天令礼包",q:537,price:0.1},
      {n:"海神神装宝箱",q:27,price:3},
      {n:"深海沉银",q:237,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:33,price:1.5},
      {n:"蓝银之种",q:194,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:11}
    ]},
    { cat: "大奖", list: [
      {n:"赤焱龙心宝箱",q:3}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:2},
      {n:"极冰领域宝箱",q:3}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:2},
      {n:"极冰领域宝箱",q:3}
    ]}
  ]},
  { server: "黄金·天使5服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:3,price:0.1},
      {n:"唐门淬火石宝箱",q:2,price:0.3},
      {n:"昊天令礼包",q:4,price:0.1},
      {n:"海神神装宝箱",q:3,price:3}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:18},
      {n:"雪茄选择宝箱3",q:16},
      {n:"雪茄选择宝箱4",q:119}
    ]},
    { cat: "大奖", list: [
      {n:"修罗宝箱(2025)",q:2},
      {n:"圣相宝匣",q:1},
      {n:"天马流星宝箱",q:24},
      {n:"真龙骨骼宝箱",q:24},
      {n:"神魔之血宝箱",q:4},
      {n:"龙纹琉璃宝箱",q:19}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:15},
      {n:"剑痴领域宝箱",q:16},
      {n:"天梦领域宝箱",q:21},
      {n:"极冰领域宝箱",q:35},
      {n:"海神领域宝箱",q:6},
      {n:"破魔领域宝箱",q:41},
      {n:"蛛皇之血宝箱",q:66}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:15},
      {n:"剑痴领域宝箱",q:16},
      {n:"天使至尊礼包",q:14},
      {n:"天使豪华礼包",q:27},
      {n:"天梦领域宝箱",q:21},
      {n:"极冰领域宝箱",q:35},
      {n:"海神领域宝箱",q:6},
      {n:"破魔领域宝箱",q:41},
      {n:"蓝银之种宝箱2",q:3},
      {n:"蛛皇之血宝箱",q:66}
    ]}
  ]},
  { server: "周年·黄金天使5服", group: "天使周年", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:11,price:0.1},
      {n:"唐门淬火石宝箱",q:2,price:0.3},
      {n:"昊天令礼包",q:10,price:0.1},
      {n:"深海沉银",q:6,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:5,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "集结·天使7服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:4,price:0.1},
      {n:"唐门淬火石宝箱",q:5,price:0.3},
      {n:"昊天令礼包",q:4,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"蓝银之种",q:6,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:2}
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:19},
      {n:"星神剑魂宝箱",q:1},
      {n:"生灵守望宝匣",q:2},
      {n:"真龙骨骼宝箱",q:13},
      {n:"赤焱龙心宝箱",q:9}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:13},
      {n:"剑痴领域宝箱",q:10},
      {n:"天梦领域宝箱",q:1},
      {n:"极冰领域宝箱",q:4},
      {n:"海神领域宝箱",q:9},
      {n:"破魔领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:75}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:13},
      {n:"剑痴领域宝箱",q:10},
      {n:"天梦领域宝箱",q:1},
      {n:"极冰领域宝箱",q:4},
      {n:"海神领域宝箱",q:9},
      {n:"破魔领域宝箱",q:3},
      {n:"蓝银之种宝箱3",q:4},
      {n:"蓝银之种宝箱5",q:17},
      {n:"蛛皇之血宝箱",q:75}
    ]}
  ]},
  { server: "黄金爆爽·天使8服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:7,price:3},
      {n:"冰火之泉",q:93,price:0.1},
      {n:"唐门淬火石宝箱",q:29,price:0.3},
      {n:"昊天令礼包",q:137,price:0.1},
      {n:"海神神装宝箱",q:9,price:3},
      {n:"深海沉银",q:40,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:20,price:1.5},
      {n:"蓝银之种",q:29,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:17},
      {n:"雪茄选择宝箱4",q:11},
      {n:"雪茄选择宝箱（2605）",q:13}
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:10},
      {n:"死之乐章宝箱",q:6},
      {n:"真龙骨骼宝箱",q:10},
      {n:"神魔之血宝箱",q:2},
      {n:"赤焱龙心宝箱",q:23},
      {n:"龙纹琉璃宝箱",q:10}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:13},
      {n:"剑痴领域宝箱",q:12},
      {n:"天梦领域宝箱",q:8},
      {n:"极冰领域宝箱",q:30},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:1},
      {n:"蛛皇之血宝箱",q:34}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:13},
      {n:"剑痴领域宝箱",q:12},
      {n:"天使至尊礼包",q:4},
      {n:"天使豪华礼包",q:12},
      {n:"天梦领域宝箱",q:8},
      {n:"极冰领域宝箱",q:30},
      {n:"死之乐章宝箱",q:6},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:1},
      {n:"蛛皇之血宝箱",q:34}
    ]}
  ]},
  { server: "万魂·天使9服", group: "天使万魂", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:29}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:25},
      {n:"审判圣装宝箱",q:26},
      {n:"生灵守望宝匣",q:35},
      {n:"罗刹神器选择宝箱",q:26},
      {n:"龙皇神装宝箱",q:84}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:31},
      {n:"剑痴领域宝箱",q:36},
      {n:"天梦领域宝箱",q:46},
      {n:"极冰领域宝箱",q:50},
      {n:"海神领域宝箱",q:48},
      {n:"破魔领域宝箱",q:46},
      {n:"蓝银之种宝箱2605",q:48},
      {n:"蛛皇之血宝箱",q:70}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:31},
      {n:"剑痴领域宝箱",q:36},
      {n:"天梦领域宝箱",q:46},
      {n:"极冰领域宝箱",q:50},
      {n:"海神领域宝箱",q:48},
      {n:"破魔领域宝箱",q:46},
      {n:"蛛皇之血宝箱",q:70}
    ]}
  ]},
  { server: "集结·天使10服", group: "天使集结", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:23},
      {n:"雪茄选择宝箱（2605）",q:5}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:28},
      {n:"赤焱龙心宝箱",q:23},
      {n:"龙皇神装宝箱",q:4}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:5},
      {n:"剑痴领域宝箱",q:6},
      {n:"天梦领域宝箱",q:10},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:17},
      {n:"蛛皇之血宝箱",q:32}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:5},
      {n:"剑痴领域宝箱",q:6},
      {n:"天梦领域宝箱",q:10},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:17},
      {n:"蛛皇之血宝箱",q:32}
    ]}
  ]},
  { server: "集结·天使13服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:1,price:3},
      {n:"冰火之泉",q:17,price:0.1},
      {n:"唐门淬火石宝箱",q:1,price:0.3},
      {n:"昊天令礼包",q:13,price:0.1},
      {n:"海神神装宝箱",q:6,price:3},
      {n:"深海沉银",q:8,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:2,price:1.5},
      {n:"蓝银之种",q:26,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:48},
      {n:"雪茄选择宝箱4",q:30}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:6}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:10},
      {n:"天梦领域宝箱",q:8},
      {n:"极冰领域宝箱",q:6},
      {n:"海神领域宝箱",q:5},
      {n:"破魔领域宝箱",q:5},
      {n:"蛛皇之血宝箱",q:15}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:10},
      {n:"天梦领域宝箱",q:8},
      {n:"极冰领域宝箱",q:6},
      {n:"海神领域宝箱",q:5},
      {n:"破魔领域宝箱",q:5},
      {n:"蓝银之种宝箱5",q:4},
      {n:"蛛皇之血宝箱",q:15}
    ]}
  ]},
  { server: "周年·黄金天使13服", group: "天使周年", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:3}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:2}
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "周年·黄金天使14服", group: "天使周年", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:4,price:3},
      {n:"冰火之泉",q:104,price:0.1},
      {n:"唐门淬火石宝箱",q:44,price:0.3},
      {n:"昊天令礼包",q:162,price:0.1},
      {n:"海神神装宝箱",q:5,price:3},
      {n:"深海沉银",q:66,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:56,price:1.5},
      {n:"蓝银之种",q:71,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:1},
      {n:"雪茄选择宝箱（2605）",q:17}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:12},
      {n:"星神剑魂宝箱",q:57},
      {n:"死之乐章宝箱",q:11},
      {n:"生灵守望宝匣",q:6}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:20},
      {n:"剑痴领域宝箱",q:22},
      {n:"天梦领域宝箱",q:29},
      {n:"极冰领域宝箱",q:22},
      {n:"海神领域宝箱",q:10},
      {n:"破魔领域宝箱",q:26},
      {n:"蛛皇之血宝箱",q:28}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:20},
      {n:"剑痴领域宝箱",q:22},
      {n:"天梦领域宝箱",q:29},
      {n:"极冰领域宝箱",q:22},
      {n:"死之乐章宝箱",q:11},
      {n:"海神领域宝箱",q:10},
      {n:"破魔领域宝箱",q:26},
      {n:"蓝银之种宝箱10",q:1},
      {n:"蛛皇之血宝箱",q:28}
    ]}
  ]},
  { server: "集结·天使16服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:1,price:3},
      {n:"冰火之泉",q:418,price:0.1},
      {n:"唐门淬火石宝箱",q:126,price:0.3},
      {n:"昊天令礼包",q:531,price:0.1},
      {n:"海神神装宝箱",q:18,price:3},
      {n:"深海沉银",q:109,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:5,price:1.5},
      {n:"蓝银之种",q:24,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:9},
      {n:"雪茄选择宝箱4",q:7},
      {n:"雪茄选择宝箱（2605）",q:155}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:15},
      {n:"圣相宝匣",q:1},
      {n:"天马流星宝箱",q:59},
      {n:"审判圣装宝箱",q:14},
      {n:"星神剑魂宝箱",q:35},
      {n:"死之乐章宝箱",q:75},
      {n:"生灵守望宝匣",q:16},
      {n:"真龙骨骼宝箱",q:65},
      {n:"罗刹神器选择宝箱",q:17},
      {n:"赤焱龙心宝箱",q:37},
      {n:"龙皇神装宝箱",q:25}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:88},
      {n:"剑痴领域宝箱",q:100},
      {n:"天梦领域宝箱",q:100},
      {n:"极冰领域宝箱",q:173},
      {n:"海神领域宝箱",q:141},
      {n:"破魔领域宝箱",q:116},
      {n:"蓝银之种宝箱2605",q:22},
      {n:"蛛皇之血宝箱",q:219}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:88},
      {n:"剑痴领域宝箱",q:100},
      {n:"天梦领域宝箱",q:100},
      {n:"极冰领域宝箱",q:173},
      {n:"死之乐章宝箱",q:75},
      {n:"海神领域宝箱",q:141},
      {n:"破魔领域宝箱",q:116},
      {n:"蓝银之种宝箱1",q:2},
      {n:"蓝银之种宝箱10",q:21},
      {n:"蓝银之种宝箱3",q:1},
      {n:"蓝银之种宝箱5",q:21},
      {n:"蛛皇之血宝箱",q:219}
    ]}
  ]},
  { server: "万魂·天使19服", group: "天使万魂", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:13,price:3},
      {n:"冰火之泉",q:8,price:0.1},
      {n:"至宝仙草礼包",q:49,price:1.5},
      {n:"蓝银之种",q:11,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:46}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:4},
      {n:"审判圣装宝箱",q:1},
      {n:"生灵守望宝匣",q:9},
      {n:"罗刹神器选择宝箱",q:12},
      {n:"龙皇神装宝箱",q:9}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:47},
      {n:"剑痴领域宝箱",q:56},
      {n:"天梦领域宝箱",q:43},
      {n:"极冰领域宝箱",q:20},
      {n:"海神领域宝箱",q:28},
      {n:"破魔领域宝箱",q:41},
      {n:"蓝银之种宝箱2605",q:30},
      {n:"蛛皇之血宝箱",q:64}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:47},
      {n:"剑痴领域宝箱",q:56},
      {n:"天梦领域宝箱",q:43},
      {n:"极冰领域宝箱",q:20},
      {n:"海神领域宝箱",q:28},
      {n:"破魔领域宝箱",q:41},
      {n:"蛛皇之血宝箱",q:64}
    ]}
  ]},
  { server: "集结·天使21服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:5,price:3},
      {n:"冰火之泉",q:115,price:0.1},
      {n:"唐门淬火石宝箱",q:39,price:0.3},
      {n:"昊天令礼包",q:135,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"深海沉银",q:51,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:10,price:1.5},
      {n:"蓝银之种",q:84,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:25},
      {n:"雪茄选择宝箱4",q:35}
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:9},
      {n:"星神剑魂宝箱",q:2},
      {n:"真龙骨骼宝箱",q:6},
      {n:"赤焱龙心宝箱",q:25}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:12},
      {n:"天梦领域宝箱",q:12},
      {n:"极冰领域宝箱",q:26},
      {n:"海神领域宝箱",q:21},
      {n:"破魔领域宝箱",q:35},
      {n:"蛛皇之血宝箱",q:28}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:12},
      {n:"天梦领域宝箱",q:12},
      {n:"极冰领域宝箱",q:26},
      {n:"海神领域宝箱",q:21},
      {n:"破魔领域宝箱",q:35},
      {n:"蛛皇之血宝箱",q:28}
    ]}
  ]},
  { server: "黄金爆爽·天使22服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:155,price:0.1},
      {n:"唐门淬火石宝箱",q:43,price:0.3},
      {n:"昊天令礼包",q:187,price:0.1},
      {n:"海神神装宝箱",q:7,price:3},
      {n:"深海沉银",q:71,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:61,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:4},
      {n:"雪茄选择宝箱4",q:39},
      {n:"雪茄选择宝箱（2605）",q:2}
    ]},
    { cat: "大奖", list: [
      {n:"赤焱龙心宝箱",q:1},
      {n:"龙纹琉璃宝箱",q:15}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:1},
      {n:"极冰领域宝箱",q:2},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:5},
      {n:"蛛皇之血宝箱",q:38}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:1},
      {n:"极冰领域宝箱",q:2},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:5},
      {n:"蛛皇之血宝箱",q:38}
    ]}
  ]},
  { server: "集结·天使22服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:20,price:3},
      {n:"冰火之泉",q:236,price:0.1},
      {n:"唐门淬火石宝箱",q:73,price:0.3},
      {n:"昊天令礼包",q:310,price:0.1},
      {n:"海神神装宝箱",q:3,price:3},
      {n:"深海沉银",q:59,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:30,price:1.5},
      {n:"蓝银之种",q:113,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:80},
      {n:"雪茄选择宝箱4",q:80},
      {n:"雪茄选择宝箱（2605）",q:24}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:4},
      {n:"天马流星宝箱",q:63},
      {n:"星神剑魂宝箱",q:18},
      {n:"死之乐章宝箱",q:10},
      {n:"真龙骨骼宝箱",q:61},
      {n:"赤焱龙心宝箱",q:95}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:50},
      {n:"剑痴领域宝箱",q:79},
      {n:"天梦领域宝箱",q:41},
      {n:"极冰领域宝箱",q:68},
      {n:"海神领域宝箱",q:46},
      {n:"破魔领域宝箱",q:81},
      {n:"蛛皇之血宝箱",q:120}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:50},
      {n:"剑痴领域宝箱",q:79},
      {n:"天梦领域宝箱",q:41},
      {n:"极冰领域宝箱",q:68},
      {n:"死之乐章宝箱",q:10},
      {n:"海神领域宝箱",q:46},
      {n:"破魔领域宝箱",q:81},
      {n:"蓝银之种宝箱1",q:3},
      {n:"蓝银之种宝箱5",q:9},
      {n:"蛛皇之血宝箱",q:120}
    ]}
  ]},
  { server: "周年·黄金天使22服", group: "天使周年", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:3,price:3},
      {n:"冰火之泉",q:71,price:0.1},
      {n:"唐门淬火石宝箱",q:15,price:0.3},
      {n:"昊天令礼包",q:58,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"深海沉银",q:30,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:5,price:1.5},
      {n:"蓝银之种",q:47,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:16},
      {n:"赤焱龙心宝箱",q:45}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:33},
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:23},
      {n:"极冰领域宝箱",q:104},
      {n:"海神领域宝箱",q:2},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:24}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:33},
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:23},
      {n:"极冰领域宝箱",q:104},
      {n:"海神领域宝箱",q:2},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:24}
    ]}
  ]},
  { server: "黄金·天使23服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:226,price:0.1},
      {n:"唐门淬火石宝箱",q:59,price:0.3},
      {n:"昊天令礼包",q:381,price:0.1},
      {n:"海神神装宝箱",q:4,price:3},
      {n:"深海沉银",q:64,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:4,price:1.5},
      {n:"蓝银之种",q:114,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱3",q:5},
      {n:"雪茄选择宝箱4",q:21}
    ]},
    { cat: "大奖", list: [
      {n:"修罗宝箱(2025)",q:6},
      {n:"星光翎羽宝箱",q:24},
      {n:"神魔之血宝箱",q:2},
      {n:"龙纹琉璃宝箱",q:12}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:13},
      {n:"剑痴领域宝箱",q:18},
      {n:"天梦领域宝箱",q:10},
      {n:"极冰领域宝箱",q:13},
      {n:"海神领域宝箱",q:1},
      {n:"破魔领域宝箱",q:9},
      {n:"蛛皇之血宝箱",q:56}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:13},
      {n:"剑痴领域宝箱",q:18},
      {n:"天使至尊礼包",q:28},
      {n:"天使豪华礼包",q:30},
      {n:"天梦领域宝箱",q:10},
      {n:"极冰领域宝箱",q:13},
      {n:"海神领域宝箱",q:1},
      {n:"破魔领域宝箱",q:9},
      {n:"蓝银之种宝箱7",q:16},
      {n:"蛛皇之血宝箱",q:56}
    ]}
  ]},
  { server: "黄金·天使24服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:82,price:0.1},
      {n:"唐门淬火石宝箱",q:23,price:0.3},
      {n:"昊天令礼包",q:70,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"深海沉银",q:4,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:25,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱4",q:18}
    ]},
    { cat: "大奖", list: [
      {n:"修罗宝箱(2025)",q:2},
      {n:"天马流星宝箱",q:3},
      {n:"星光翎羽宝箱",q:15},
      {n:"真龙骨骼宝箱",q:24}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"极冰领域宝箱",q:59},
      {n:"蛛皇之血宝箱",q:37}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"天使豪华礼包",q:7},
      {n:"极冰领域宝箱",q:59},
      {n:"蛛皇之血宝箱",q:37}
    ]}
  ]},
  { server: "集结·天使25服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:1,price:0.1}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:67},
      {n:"雪茄选择宝箱4",q:8}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:41},
      {n:"星神剑魂宝箱",q:25},
      {n:"真龙骨骼宝箱",q:1},
      {n:"赤焱龙心宝箱",q:8}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:7},
      {n:"剑痴领域宝箱",q:6},
      {n:"天梦领域宝箱",q:6},
      {n:"极冰领域宝箱",q:8},
      {n:"海神领域宝箱",q:19},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:48}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:7},
      {n:"剑痴领域宝箱",q:6},
      {n:"天梦领域宝箱",q:6},
      {n:"极冰领域宝箱",q:8},
      {n:"海神领域宝箱",q:19},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:48}
    ]}
  ]},
  { server: "黄金·天使26服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:82,price:0.1},
      {n:"唐门淬火石宝箱",q:32,price:0.3},
      {n:"昊天令礼包",q:117,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:28,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:22,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:1},
      {n:"雪茄选择宝箱3",q:34},
      {n:"雪茄选择宝箱4",q:74},
      {n:"雪茄选择宝箱5",q:16},
      {n:"雪茄选择宝箱（2605）",q:6}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:3},
      {n:"星神剑魂宝箱",q:11},
      {n:"真龙骨骼宝箱",q:3},
      {n:"神魔之血宝箱",q:27},
      {n:"赤焱龙心宝箱",q:12},
      {n:"龙纹琉璃宝箱",q:105}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:1},
      {n:"万剑归宗宝箱",q:4},
      {n:"万魂领域宝箱",q:1},
      {n:"剑痴领域宝箱",q:5},
      {n:"天梦领域宝箱",q:2},
      {n:"暗月领域宝箱",q:1},
      {n:"极冰领域宝箱",q:22},
      {n:"海神领域宝箱",q:8},
      {n:"破魔领域宝箱",q:10},
      {n:"蛛皇之血宝箱",q:151},
      {n:"金龙狂暴宝箱",q:3},
      {n:"魔鲨领域宝箱",q:1}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:1},
      {n:"万剑归宗宝箱",q:4},
      {n:"剑痴领域宝箱",q:5},
      {n:"天使至尊礼包",q:21},
      {n:"天使豪华礼包",q:18},
      {n:"天梦领域宝箱",q:2},
      {n:"幻之领域宝箱",q:1},
      {n:"暗月领域宝箱",q:1},
      {n:"极冰领域宝箱",q:22},
      {n:"海神领域宝箱",q:8},
      {n:"炎神领域宝箱4",q:1},
      {n:"玄武之域宝箱",q:1},
      {n:"破魔领域宝箱",q:10},
      {n:"蓝银之种宝箱1",q:3},
      {n:"蛛皇之血宝箱",q:151},
      {n:"金龙狂暴宝箱",q:3},
      {n:"魔鲨领域宝箱",q:1}
    ]}
  ]},
  { server: "集结·天使26服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:11,price:3},
      {n:"冰火之泉",q:27,price:0.1},
      {n:"唐门淬火石宝箱",q:9,price:0.3},
      {n:"昊天令礼包",q:18,price:0.1},
      {n:"深海沉银",q:14,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:12,price:1.5},
      {n:"蓝银之种",q:21,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:44},
      {n:"雪茄选择宝箱4",q:5}
    ]},
    { cat: "大奖", list: [
      {n:"赤焱龙心宝箱",q:18}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:5},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:2}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:5},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:2}
    ]}
  ]},
  { server: "黄金·天使27服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:5,price:0.1},
      {n:"唐门淬火石宝箱",q:11,price:0.3},
      {n:"昊天令礼包",q:76,price:0.1},
      {n:"深海沉银",q:2,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:15,price:1.5},
      {n:"蓝银之种",q:27,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱3",q:30},
      {n:"雪茄选择宝箱4",q:8}
    ]},
    { cat: "大奖", list: [
      {n:"修罗宝箱(2025)",q:7},
      {n:"星光翎羽宝箱",q:10},
      {n:"星神剑魂宝箱",q:45},
      {n:"神魔之血宝箱",q:6},
      {n:"龙纹琉璃宝箱",q:5}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:3},
      {n:"天梦领域宝箱",q:3},
      {n:"暗月领域宝箱",q:11},
      {n:"极冰领域宝箱",q:16},
      {n:"海神领域宝箱",q:2},
      {n:"破魔领域宝箱",q:7},
      {n:"蛛皇之血宝箱",q:39},
      {n:"金龙狂暴宝箱",q:32}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:3},
      {n:"天使至尊礼包",q:6},
      {n:"天使豪华礼包",q:9},
      {n:"天梦领域宝箱",q:3},
      {n:"暗月领域宝箱",q:11},
      {n:"极冰领域宝箱",q:16},
      {n:"海神领域宝箱",q:2},
      {n:"破魔领域宝箱",q:7},
      {n:"蓝银之种宝箱7",q:5},
      {n:"蛛皇之血宝箱",q:39},
      {n:"金龙狂暴宝箱",q:32}
    ]}
  ]},
  { server: "黄金爆爽·天使27服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:16,price:0.1},
      {n:"唐门淬火石宝箱",q:61,price:0.3},
      {n:"昊天令礼包",q:160,price:0.1},
      {n:"蓝银之种",q:12,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:105},
      {n:"雪茄选择宝箱4",q:36}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:17},
      {n:"真龙骨骼宝箱",q:2},
      {n:"神魔之血宝箱",q:16},
      {n:"赤焱龙心宝箱",q:10},
      {n:"龙纹琉璃宝箱",q:1}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:19},
      {n:"剑痴领域宝箱",q:30},
      {n:"天梦领域宝箱",q:2},
      {n:"极冰领域宝箱",q:33},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:21},
      {n:"蛛皇之血宝箱",q:82}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:19},
      {n:"剑痴领域宝箱",q:30},
      {n:"天梦领域宝箱",q:2},
      {n:"极冰领域宝箱",q:33},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:21},
      {n:"蓝银之种宝箱3",q:1},
      {n:"蓝银之种宝箱5",q:3},
      {n:"蓝银之种宝箱8",q:3},
      {n:"蛛皇之血宝箱",q:82}
    ]}
  ]},
  { server: "万魂·天使27服", group: "天使万魂", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:8,price:3},
      {n:"至宝仙草礼包",q:10,price:1.5},
      {n:"蓝银之种",q:6,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使28服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:8,price:3},
      {n:"冰火之泉",q:107,price:0.1},
      {n:"唐门淬火石宝箱",q:43,price:0.3},
      {n:"昊天令礼包",q:258,price:0.1},
      {n:"海神神装宝箱",q:4,price:3},
      {n:"深海沉银",q:30,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:28,price:1.5},
      {n:"蓝银之种",q:53,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:9},
      {n:"雪茄选择宝箱4",q:23},
      {n:"雪茄选择宝箱5",q:25}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:4},
      {n:"星光翎羽宝箱",q:5},
      {n:"神魔之血宝箱",q:2},
      {n:"赤焱龙心宝箱",q:1},
      {n:"龙纹琉璃宝箱",q:58}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:2},
      {n:"暗月领域宝箱",q:1},
      {n:"极冰领域宝箱",q:2},
      {n:"破魔领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:185},
      {n:"金龙狂暴宝箱",q:4}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:2},
      {n:"天使至尊礼包",q:26},
      {n:"天使豪华礼包",q:27},
      {n:"暗月领域宝箱",q:1},
      {n:"极冰领域宝箱",q:2},
      {n:"炎神领域宝箱4",q:1},
      {n:"破魔领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:185},
      {n:"金龙狂暴宝箱",q:4}
    ]}
  ]},
  { server: "集结·天使29服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:184,price:0.1},
      {n:"唐门淬火石宝箱",q:34,price:0.3},
      {n:"昊天令礼包",q:179,price:0.1},
      {n:"海神神装宝箱",q:3,price:3},
      {n:"深海沉银",q:65,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:3,price:1.5},
      {n:"蓝银之种",q:92,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:1}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:2}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:6},
      {n:"剑痴领域宝箱",q:9},
      {n:"天梦领域宝箱",q:5},
      {n:"极冰领域宝箱",q:12},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:25}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:6},
      {n:"剑痴领域宝箱",q:9},
      {n:"天梦领域宝箱",q:5},
      {n:"极冰领域宝箱",q:12},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:25}
    ]}
  ]},
  { server: "黄金·天使31服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:39,price:0.1},
      {n:"唐门淬火石宝箱",q:10,price:0.3},
      {n:"昊天令礼包",q:56,price:0.1},
      {n:"海神神装宝箱",q:5,price:3},
      {n:"深海沉银",q:4,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:12,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱4",q:1},
      {n:"雪茄选择宝箱5",q:3}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:7}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:19}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:3},
      {n:"天使至尊礼包",q:2},
      {n:"天使豪华礼包",q:10},
      {n:"蛛皇之血宝箱",q:19}
    ]}
  ]},
  { server: "集结·天使31服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:3,price:3},
      {n:"冰火之泉",q:79,price:0.1},
      {n:"唐门淬火石宝箱",q:10,price:0.3},
      {n:"昊天令礼包",q:76,price:0.1},
      {n:"海神神装宝箱",q:4,price:3},
      {n:"深海沉银",q:35,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:2,price:1.5},
      {n:"蓝银之种",q:37,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱4",q:2}
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使32服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:26,price:0.1},
      {n:"唐门淬火石宝箱",q:5,price:0.3},
      {n:"昊天令礼包",q:39,price:0.1},
      {n:"深海沉银",q:12,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:10,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
      {n:"天使至尊礼包",q:1}
    ]}
  ]},
  { server: "万魂·天使32服", group: "天使万魂", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:9,price:3},
      {n:"至宝仙草礼包",q:6,price:1.5}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使33服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:196,price:0.1},
      {n:"唐门淬火石宝箱",q:54,price:0.3},
      {n:"昊天令礼包",q:267,price:0.1},
      {n:"海神神装宝箱",q:3,price:3},
      {n:"深海沉银",q:54,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:54,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:87}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:6},
      {n:"星神剑魂宝箱",q:47},
      {n:"神魔之血宝箱",q:3},
      {n:"赤焱龙心宝箱",q:5}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"万剑归宗宝箱",q:11},
      {n:"剑痴领域宝箱",q:4},
      {n:"吞噬领域宝箱",q:2},
      {n:"极冰领域宝箱",q:6},
      {n:"海神领域宝箱",q:5},
      {n:"破魔领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:43}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"万剑归宗宝箱",q:11},
      {n:"五行领域宝箱",q:12},
      {n:"剑痴领域宝箱",q:4},
      {n:"吞噬领域宝箱",q:2},
      {n:"天使至尊礼包",q:11},
      {n:"天使豪华礼包",q:11},
      {n:"极冰领域宝箱",q:6},
      {n:"海神领域宝箱",q:5},
      {n:"破魔领域宝箱",q:3},
      {n:"蓝银之种宝箱5",q:9},
      {n:"蛛皇之血宝箱",q:43}
    ]}
  ]},
  { server: "万魂·天使33服", group: "天使万魂", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:5,price:3},
      {n:"至宝仙草礼包",q:13,price:1.5},
      {n:"蓝银之种",q:4,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金爆爽·天使34服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:15,price:3},
      {n:"冰火之泉",q:262,price:0.1},
      {n:"唐门淬火石宝箱",q:88,price:0.3},
      {n:"昊天令礼包",q:473,price:0.1},
      {n:"海神神装宝箱",q:17,price:3},
      {n:"深海沉银",q:51,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:67,price:1.5}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:3},
      {n:"真龙骨骼宝箱",q:2},
      {n:"赤焱龙心宝箱",q:27},
      {n:"龙纹琉璃宝箱",q:36}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:45},
      {n:"天梦领域宝箱",q:13},
      {n:"极冰领域宝箱",q:14},
      {n:"海神领域宝箱",q:21},
      {n:"破魔领域宝箱",q:15},
      {n:"蛛皇之血宝箱",q:42}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"剑痴领域宝箱",q:45},
      {n:"天梦领域宝箱",q:13},
      {n:"极冰领域宝箱",q:14},
      {n:"海神领域宝箱",q:21},
      {n:"破魔领域宝箱",q:15},
      {n:"蛛皇之血宝箱",q:42}
    ]}
  ]},
  { server: "集结·天使35服", group: "天使集结", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:12,price:3},
      {n:"冰火之泉",q:35,price:0.1},
      {n:"唐门淬火石宝箱",q:8,price:0.3},
      {n:"昊天令礼包",q:51,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:21,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:8,price:1.5},
      {n:"蓝银之种",q:21,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:2}
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:3},
      {n:"天梦领域宝箱",q:1},
      {n:"海神领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:5}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:3},
      {n:"天梦领域宝箱",q:1},
      {n:"海神领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:5}
    ]}
  ]},
  { server: "黄金·天使40服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:3,price:0.1},
      {n:"唐门淬火石宝箱",q:50,price:0.3},
      {n:"昊天令礼包",q:212,price:0.1},
      {n:"海神神装宝箱",q:9,price:3},
      {n:"深海沉银",q:84,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:3,price:1.5},
      {n:"蓝银之种",q:70,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:21},
      {n:"雪茄选择宝箱3",q:20},
      {n:"雪茄选择宝箱4",q:69}
    ]},
    { cat: "大奖", list: [
      {n:"修罗宝箱(2025)",q:2},
      {n:"圣相宝匣",q:4},
      {n:"天马流星宝箱",q:13},
      {n:"星光翎羽宝箱",q:25},
      {n:"真龙骨骼宝箱",q:9},
      {n:"神魔之血宝箱",q:129},
      {n:"赤焱龙心宝箱",q:2},
      {n:"龙纹琉璃宝箱",q:92}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:49},
      {n:"剑痴领域宝箱",q:9},
      {n:"吞噬领域宝箱",q:1},
      {n:"天梦领域宝箱",q:67},
      {n:"暗月领域宝箱",q:2},
      {n:"极冰领域宝箱",q:12},
      {n:"海神领域宝箱",q:37},
      {n:"破魔领域宝箱",q:27},
      {n:"蛛皇之血宝箱",q:299},
      {n:"金龙狂暴宝箱",q:3},
      {n:"魔鲨领域宝箱",q:2}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:49},
      {n:"剑痴领域宝箱",q:9},
      {n:"吞噬领域宝箱",q:1},
      {n:"天使至尊礼包",q:88},
      {n:"天使豪华礼包",q:102},
      {n:"天梦领域宝箱",q:67},
      {n:"幻之领域宝箱",q:2},
      {n:"暗月领域宝箱",q:2},
      {n:"极冰领域宝箱",q:12},
      {n:"海神领域宝箱",q:37},
      {n:"炎神领域宝箱4",q:3},
      {n:"玄武之域宝箱",q:3},
      {n:"破魔领域宝箱",q:27},
      {n:"蓝银之种宝箱2",q:6},
      {n:"蓝银之种宝箱8",q:10},
      {n:"蓝银之种宝箱9",q:4},
      {n:"蛛皇之血宝箱",q:299},
      {n:"金龙狂暴宝箱",q:3},
      {n:"魔鲨领域宝箱",q:2}
    ]}
  ]},
  { server: "黄金·天使43服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:8,price:3},
      {n:"冰火之泉",q:169,price:0.1},
      {n:"唐门淬火石宝箱",q:48,price:0.3},
      {n:"昊天令礼包",q:253,price:0.1},
      {n:"海神神装宝箱",q:15,price:3},
      {n:"深海沉银",q:32,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:19,price:1.5},
      {n:"蓝银之种",q:105,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:48},
      {n:"雪茄选择宝箱3",q:47},
      {n:"雪茄选择宝箱4",q:40}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:13},
      {n:"星光翎羽宝箱",q:41},
      {n:"神魔之血宝箱",q:1},
      {n:"龙纹琉璃宝箱",q:21}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"剑痴领域宝箱",q:2},
      {n:"天梦领域宝箱",q:1},
      {n:"极冰领域宝箱",q:24},
      {n:"破魔领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:121}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"剑痴领域宝箱",q:2},
      {n:"天使至尊礼包",q:126},
      {n:"天使豪华礼包",q:159},
      {n:"天梦领域宝箱",q:1},
      {n:"极冰领域宝箱",q:24},
      {n:"破魔领域宝箱",q:3},
      {n:"蓝银之种宝箱8",q:5},
      {n:"蛛皇之血宝箱",q:121}
    ]}
  ]},
  { server: "黄金·天使44服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:7,price:3},
      {n:"至宝仙草礼包",q:49,price:1.5},
      {n:"蓝银之种",q:5,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:76},
      {n:"雪茄选择宝箱4",q:108}
    ]},
    { cat: "大奖", list: [
      {n:"星光翎羽宝箱",q:10},
      {n:"赤焱龙心宝箱",q:13},
      {n:"龙纹琉璃宝箱",q:127}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:3},
      {n:"剑痴领域宝箱",q:50},
      {n:"天梦领域宝箱",q:2},
      {n:"极冰领域宝箱",q:38},
      {n:"海神领域宝箱",q:22},
      {n:"破魔领域宝箱",q:88},
      {n:"蛛皇之血宝箱",q:40}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:3},
      {n:"剑痴领域宝箱",q:50},
      {n:"天使至尊礼包",q:12},
      {n:"天使豪华礼包",q:61},
      {n:"天梦领域宝箱",q:2},
      {n:"极冰领域宝箱",q:38},
      {n:"海神领域宝箱",q:22},
      {n:"破魔领域宝箱",q:88},
      {n:"蓝银之种宝箱8",q:7},
      {n:"蛛皇之血宝箱",q:40}
    ]}
  ]},
  { server: "黄金·天使50服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:8,price:3},
      {n:"冰火之泉",q:49,price:0.1},
      {n:"唐门淬火石宝箱",q:15,price:0.3},
      {n:"昊天令礼包",q:96,price:0.1},
      {n:"深海沉银",q:6,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:19,price:1.5},
      {n:"蓝银之种",q:49,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱3",q:12}
    ]},
    { cat: "大奖", list: [
      {n:"神魔之血宝箱",q:58}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:28},
      {n:"极冰领域宝箱",q:25},
      {n:"破魔领域宝箱",q:23}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:28},
      {n:"天使至尊礼包",q:47},
      {n:"天使豪华礼包",q:60},
      {n:"极冰领域宝箱",q:25},
      {n:"破魔领域宝箱",q:23}
    ]}
  ]},
  { server: "黄金爆爽·天使52服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:10,price:3},
      {n:"冰火之泉",q:28,price:0.1},
      {n:"唐门淬火石宝箱",q:6,price:0.3},
      {n:"昊天令礼包",q:15,price:0.1},
      {n:"深海沉银",q:13,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:17,price:1.5},
      {n:"蓝银之种",q:28,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:1},
      {n:"雪茄选择宝箱4",q:10}
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:1}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:12},
      {n:"极冰领域宝箱",q:3},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:21},
      {n:"蛛皇之血宝箱",q:1}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:12},
      {n:"极冰领域宝箱",q:3},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:21},
      {n:"蛛皇之血宝箱",q:1}
    ]}
  ]},
  { server: "黄金·天使53服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:10,price:3},
      {n:"冰火之泉",q:166,price:0.1},
      {n:"唐门淬火石宝箱",q:33,price:0.3},
      {n:"昊天令礼包",q:236,price:0.1},
      {n:"海神神装宝箱",q:19,price:3},
      {n:"深海沉银",q:21,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:17,price:1.5},
      {n:"蓝银之种",q:36,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:10},
      {n:"雪茄选择宝箱3",q:2},
      {n:"雪茄选择宝箱4",q:46},
      {n:"雪茄选择宝箱（2605）",q:46}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:3},
      {n:"星神剑魂宝箱",q:80},
      {n:"真龙骨骼宝箱",q:7},
      {n:"龙皇神装宝箱",q:56},
      {n:"龙纹琉璃宝箱",q:126}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:12},
      {n:"剑痴领域宝箱",q:3},
      {n:"天梦领域宝箱",q:60},
      {n:"暗月领域宝箱",q:3},
      {n:"极冰领域宝箱",q:50},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:211},
      {n:"金龙狂暴宝箱",q:8}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:12},
      {n:"剑痴领域宝箱",q:3},
      {n:"天使至尊礼包",q:29},
      {n:"天使豪华礼包",q:45},
      {n:"天梦领域宝箱",q:60},
      {n:"暗月领域宝箱",q:3},
      {n:"极冰领域宝箱",q:50},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:4},
      {n:"蓝银之种宝箱8",q:63},
      {n:"蛛皇之血宝箱",q:211},
      {n:"金龙狂暴宝箱",q:8}
    ]}
  ]},
  { server: "黄金爆爽·天使54服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:14,price:3},
      {n:"冰火之泉",q:44,price:0.1},
      {n:"唐门淬火石宝箱",q:48,price:0.3},
      {n:"昊天令礼包",q:307,price:0.1},
      {n:"海神神装宝箱",q:9,price:3},
      {n:"深海沉银",q:92,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:12,price:1.5},
      {n:"蓝银之种",q:21,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:24},
      {n:"雪茄选择宝箱4",q:14},
      {n:"雪茄选择宝箱（2605）",q:23}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:27},
      {n:"审判圣装宝箱",q:4},
      {n:"星神剑魂宝箱",q:5},
      {n:"生灵守望宝匣",q:11},
      {n:"罗刹神器选择宝箱",q:6},
      {n:"赤焱龙心宝箱",q:14},
      {n:"龙皇神装宝箱",q:4}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:23},
      {n:"剑痴领域宝箱",q:47},
      {n:"天梦领域宝箱",q:25},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:30},
      {n:"破魔领域宝箱",q:47},
      {n:"蛛皇之血宝箱",q:21}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:23},
      {n:"剑痴领域宝箱",q:47},
      {n:"天梦领域宝箱",q:25},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:30},
      {n:"破魔领域宝箱",q:47},
      {n:"蓝银之种宝箱1",q:7},
      {n:"蓝银之种宝箱10",q:2},
      {n:"蓝银之种宝箱5",q:15},
      {n:"蛛皇之血宝箱",q:21}
    ]}
  ]},
  { server: "黄金·天使58服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"唐门淬火石宝箱",q:7,price:0.3},
      {n:"昊天令礼包",q:41,price:0.1},
      {n:"深海沉银",q:6,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:3,price:1.5},
      {n:"蓝银之种",q:8,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:50},
      {n:"雪茄选择宝箱（2605）",q:3}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:8},
      {n:"圣相宝匣",q:2},
      {n:"星光翎羽宝箱",q:14},
      {n:"星神剑魂宝箱",q:1},
      {n:"真龙骨骼宝箱",q:1},
      {n:"神魔之血宝箱",q:66},
      {n:"罗刹神器选择宝箱",q:2},
      {n:"赤焱龙心宝箱",q:9},
      {n:"龙皇神装宝箱",q:9},
      {n:"龙纹琉璃宝箱",q:1}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:3},
      {n:"吞噬领域宝箱",q:9},
      {n:"天梦领域宝箱",q:24},
      {n:"暗月领域宝箱",q:38},
      {n:"极冰领域宝箱",q:16},
      {n:"海神领域宝箱",q:11},
      {n:"炎神领域宝箱2605",q:15},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:141}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:3},
      {n:"吞噬领域宝箱",q:9},
      {n:"天使至尊礼包",q:10},
      {n:"天使豪华礼包",q:45},
      {n:"天梦领域宝箱",q:24},
      {n:"暗月领域宝箱",q:38},
      {n:"极冰领域宝箱",q:16},
      {n:"海神领域宝箱",q:11},
      {n:"破魔领域宝箱",q:4},
      {n:"蓝银之种宝箱7",q:6},
      {n:"蓝银之种宝箱8",q:6},
      {n:"蛛皇之血宝箱",q:141}
    ]}
  ]},
  { server: "黄金爆爽·天使60服", group: "天使爆爽", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:4}
    ]},
    { cat: "大奖", list: [
      {n:"圣相宝匣",q:1},
      {n:"天马流星宝箱",q:28},
      {n:"真龙骨骼宝箱",q:10},
      {n:"龙纹琉璃宝箱",q:35}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:7},
      {n:"剑痴领域宝箱",q:32},
      {n:"天梦领域宝箱",q:23},
      {n:"极冰领域宝箱",q:32},
      {n:"海神领域宝箱",q:22},
      {n:"破魔领域宝箱",q:29},
      {n:"蛛皇之血宝箱",q:38}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:7},
      {n:"剑痴领域宝箱",q:32},
      {n:"天梦领域宝箱",q:23},
      {n:"极冰领域宝箱",q:32},
      {n:"海神领域宝箱",q:22},
      {n:"破魔领域宝箱",q:29},
      {n:"蓝银之种宝箱1",q:5},
      {n:"蓝银之种宝箱3",q:9},
      {n:"蓝银之种宝箱8",q:11},
      {n:"蛛皇之血宝箱",q:38}
    ]}
  ]},
  { server: "黄金爆爽·天使61服", group: "天使爆爽", items: [
    { cat: "背包", list: [
      {n:"唐门淬火石宝箱",q:33,price:0.3},
      {n:"昊天令礼包",q:121,price:0.1},
      {n:"海神神装宝箱",q:6,price:3},
      {n:"深海沉银",q:4,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:8,price:1.5},
      {n:"蓝银之种",q:63,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使63服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:19,price:0.1},
      {n:"唐门淬火石宝箱",q:2,price:0.3},
      {n:"昊天令礼包",q:10,price:0.1},
      {n:"深海沉银",q:3,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:8,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:5},
      {n:"雪茄选择宝箱4",q:2}
    ]},
    { cat: "大奖", list: [
      {n:"天马流星宝箱",q:1},
      {n:"星神剑魂宝箱",q:4},
      {n:"神魔之血宝箱",q:3}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"极冰领域宝箱",q:2},
      {n:"蛛皇之血宝箱",q:11}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"天使至尊礼包",q:3},
      {n:"极冰领域宝箱",q:2},
      {n:"蓝银之种宝箱5",q:4},
      {n:"蛛皇之血宝箱",q:11}
    ]}
  ]},
  { server: "黄金·天使72服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:11,price:3},
      {n:"冰火之泉",q:84,price:0.1},
      {n:"唐门淬火石宝箱",q:21,price:0.3},
      {n:"昊天令礼包",q:116,price:0.1},
      {n:"海神神装宝箱",q:12,price:3},
      {n:"深海沉银",q:34,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:37,price:1.5},
      {n:"蓝银之种",q:39,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:3},
      {n:"雪茄选择宝箱（2605）",q:1}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:3},
      {n:"星神剑魂宝箱",q:20}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:18},
      {n:"天梦领域宝箱",q:11},
      {n:"极冰领域宝箱",q:7},
      {n:"海神领域宝箱",q:20},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:27}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:18},
      {n:"天梦领域宝箱",q:11},
      {n:"极冰领域宝箱",q:7},
      {n:"海神领域宝箱",q:20},
      {n:"破魔领域宝箱",q:8},
      {n:"蓝银之种宝箱5",q:25},
      {n:"蛛皇之血宝箱",q:27}
    ]}
  ]},
  { server: "黄金·天使74服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:7,price:3},
      {n:"冰火之泉",q:271,price:0.1},
      {n:"唐门淬火石宝箱",q:63,price:0.3},
      {n:"昊天令礼包",q:278,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"深海沉银",q:127,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:18,price:1.5},
      {n:"蓝银之种",q:108,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:54},
      {n:"雪茄选择宝箱（2605）",q:13}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:101},
      {n:"死之乐章宝箱",q:14},
      {n:"赤焱龙心宝箱",q:3}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:22},
      {n:"剑痴领域宝箱",q:24},
      {n:"天梦领域宝箱",q:25},
      {n:"极冰领域宝箱",q:52},
      {n:"海神领域宝箱",q:21},
      {n:"破魔领域宝箱",q:26},
      {n:"蛛皇之血宝箱",q:61}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:22},
      {n:"剑痴领域宝箱",q:24},
      {n:"天梦领域宝箱",q:25},
      {n:"极冰领域宝箱",q:52},
      {n:"死之乐章宝箱",q:14},
      {n:"海神领域宝箱",q:21},
      {n:"破魔领域宝箱",q:26},
      {n:"蛛皇之血宝箱",q:61}
    ]}
  ]},
  { server: "黄金·天使76服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:28,price:3},
      {n:"冰火之泉",q:26,price:0.1},
      {n:"唐门淬火石宝箱",q:10,price:0.3},
      {n:"昊天令礼包",q:34,price:0.1},
      {n:"海神神装宝箱",q:6,price:3},
      {n:"深海沉银",q:17,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:75,price:1.5},
      {n:"蓝银之种",q:39,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:303}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:11},
      {n:"星神剑魂宝箱",q:4},
      {n:"死之乐章宝箱",q:110},
      {n:"生灵守望宝匣",q:29},
      {n:"龙皇神装宝箱",q:1}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:16},
      {n:"剑痴领域宝箱",q:32},
      {n:"天梦领域宝箱",q:29},
      {n:"极冰领域宝箱",q:9},
      {n:"海神领域宝箱",q:14},
      {n:"破魔领域宝箱",q:23},
      {n:"蛛皇之血宝箱",q:181}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:16},
      {n:"剑痴领域宝箱",q:32},
      {n:"天梦领域宝箱",q:29},
      {n:"极冰领域宝箱",q:9},
      {n:"死之乐章宝箱",q:110},
      {n:"海神领域宝箱",q:14},
      {n:"破魔领域宝箱",q:23},
      {n:"蓝银之种宝箱10",q:8},
      {n:"蛛皇之血宝箱",q:181}
    ]}
  ]},
  { server: "黄金·天使78服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:2,price:3},
      {n:"冰火之泉",q:9,price:0.1},
      {n:"唐门淬火石宝箱",q:5,price:0.3},
      {n:"昊天令礼包",q:113,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"深海沉银",q:6,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:7,price:1.5},
      {n:"蓝银之种",q:2,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:5},
      {n:"雪茄选择宝箱（2605）",q:5}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:12},
      {n:"死之乐章宝箱",q:9},
      {n:"赤焱龙心宝箱",q:2}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:6},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:26},
      {n:"极冰领域宝箱",q:14},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:9},
      {n:"蛛皇之血宝箱",q:61}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:6},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:26},
      {n:"极冰领域宝箱",q:14},
      {n:"死之乐章宝箱",q:9},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:9},
      {n:"蛛皇之血宝箱",q:61}
    ]}
  ]},
  { server: "黄金·天使80服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"唐门淬火石宝箱",q:100,price:0.3},
      {n:"昊天令礼包",q:423,price:0.1},
      {n:"海神神装宝箱",q:28,price:3},
      {n:"深海沉银",q:45,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:1,price:1.5},
      {n:"蓝银之种",q:57,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:38},
      {n:"雪茄选择宝箱（2605）",q:5}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:74},
      {n:"死之乐章宝箱",q:11}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:16},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:21},
      {n:"极冰领域宝箱",q:15},
      {n:"海神领域宝箱",q:12},
      {n:"破魔领域宝箱",q:9},
      {n:"蛛皇之血宝箱",q:49}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:16},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:21},
      {n:"极冰领域宝箱",q:15},
      {n:"死之乐章宝箱",q:11},
      {n:"海神领域宝箱",q:12},
      {n:"破魔领域宝箱",q:9},
      {n:"蓝银之种宝箱5",q:15},
      {n:"蛛皇之血宝箱",q:49}
    ]}
  ]},
  { server: "黄金·天使82服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:1,price:3},
      {n:"唐门淬火石宝箱",q:60,price:0.3},
      {n:"昊天令礼包",q:282,price:0.1},
      {n:"海神神装宝箱",q:6,price:3},
      {n:"深海沉银",q:2,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:44,price:1.5},
      {n:"蓝银之种",q:103,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:14},
      {n:"雪茄选择宝箱（2605）",q:29}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:178},
      {n:"死之乐章宝箱",q:7}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:62},
      {n:"剑痴领域宝箱",q:48},
      {n:"天梦领域宝箱",q:19},
      {n:"极冰领域宝箱",q:43},
      {n:"海神领域宝箱",q:12},
      {n:"破魔领域宝箱",q:37},
      {n:"蛛皇之血宝箱",q:108}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:62},
      {n:"剑痴领域宝箱",q:48},
      {n:"天梦领域宝箱",q:19},
      {n:"极冰领域宝箱",q:43},
      {n:"死之乐章宝箱",q:7},
      {n:"海神领域宝箱",q:12},
      {n:"破魔领域宝箱",q:37},
      {n:"蓝银之种宝箱10",q:9},
      {n:"蓝银之种宝箱5",q:51},
      {n:"蛛皇之血宝箱",q:108}
    ]}
  ]},
  { server: "黄金·天使83服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:1,price:3},
      {n:"冰火之泉",q:351,price:0.1},
      {n:"唐门淬火石宝箱",q:97,price:0.3},
      {n:"昊天令礼包",q:501,price:0.1},
      {n:"海神神装宝箱",q:32,price:3},
      {n:"深海沉银",q:143,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:7,price:1.5},
      {n:"蓝银之种",q:109,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:36}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:19},
      {n:"死之乐章宝箱",q:38}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:17},
      {n:"极冰领域宝箱",q:13},
      {n:"蛛皇之血宝箱",q:77}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:17},
      {n:"极冰领域宝箱",q:13},
      {n:"死之乐章宝箱",q:38},
      {n:"蛛皇之血宝箱",q:77}
    ]}
  ]},
  { server: "黄金·天使84服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"唐门淬火石宝箱",q:10,price:0.3},
      {n:"昊天令礼包",q:126,price:0.1},
      {n:"海神神装宝箱",q:6,price:3},
      {n:"深海沉银",q:6,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:4,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:4},
      {n:"雪茄选择宝箱（2605）",q:12}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:31},
      {n:"死之乐章宝箱",q:37},
      {n:"龙皇神装宝箱",q:4}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:24},
      {n:"剑痴领域宝箱",q:21},
      {n:"天梦领域宝箱",q:20},
      {n:"极冰领域宝箱",q:63},
      {n:"海神领域宝箱",q:18},
      {n:"破魔领域宝箱",q:46},
      {n:"蛛皇之血宝箱",q:52}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:24},
      {n:"剑痴领域宝箱",q:21},
      {n:"天梦领域宝箱",q:20},
      {n:"极冰领域宝箱",q:63},
      {n:"死之乐章宝箱",q:37},
      {n:"海神领域宝箱",q:18},
      {n:"破魔领域宝箱",q:46},
      {n:"蓝银之种宝箱10",q:1},
      {n:"蓝银之种宝箱5",q:24},
      {n:"蛛皇之血宝箱",q:52}
    ]}
  ]},
  { server: "黄金·天使85服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:41,price:0.1},
      {n:"唐门淬火石宝箱",q:15,price:0.3},
      {n:"昊天令礼包",q:22,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:2,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:1,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:15}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:1},
      {n:"星神剑魂宝箱",q:12},
      {n:"死之乐章宝箱",q:8}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:5},
      {n:"天梦领域宝箱",q:4},
      {n:"极冰领域宝箱",q:3},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:17},
      {n:"蛛皇之血宝箱",q:5}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:5},
      {n:"天梦领域宝箱",q:4},
      {n:"极冰领域宝箱",q:3},
      {n:"死之乐章宝箱",q:8},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:17},
      {n:"蓝银之种宝箱10",q:2},
      {n:"蛛皇之血宝箱",q:5}
    ]}
  ]},
  { server: "黄金·天使86服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:2},
      {n:"雪茄选择宝箱（2605）",q:7}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:1},
      {n:"死之乐章宝箱",q:3}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"破魔领域宝箱",q:1},
      {n:"蛛皇之血宝箱",q:37}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"死之乐章宝箱",q:3},
      {n:"破魔领域宝箱",q:1},
      {n:"蛛皇之血宝箱",q:37}
    ]}
  ]},
  { server: "黄金·天使89服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:6,price:3},
      {n:"冰火之泉",q:229,price:0.1},
      {n:"唐门淬火石宝箱",q:32,price:0.3},
      {n:"昊天令礼包",q:319,price:0.1},
      {n:"海神神装宝箱",q:10,price:3},
      {n:"深海沉银",q:56,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:45,price:1.5},
      {n:"蓝银之种",q:21,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:2}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:7},
      {n:"星神剑魂宝箱",q:9},
      {n:"死之乐章宝箱",q:60}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:18},
      {n:"极冰领域宝箱",q:14},
      {n:"海神领域宝箱",q:8},
      {n:"破魔领域宝箱",q:23},
      {n:"蛛皇之血宝箱",q:45}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:18},
      {n:"极冰领域宝箱",q:14},
      {n:"死之乐章宝箱",q:60},
      {n:"海神领域宝箱",q:8},
      {n:"破魔领域宝箱",q:23},
      {n:"蓝银之种宝箱5",q:14},
      {n:"蛛皇之血宝箱",q:45}
    ]}
  ]},
  { server: "黄金·天使91服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:4,price:3},
      {n:"至宝仙草礼包",q:15,price:1.5},
      {n:"蓝银之种",q:1,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:2}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:17}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:5},
      {n:"极冰领域宝箱",q:7},
      {n:"海神领域宝箱",q:1},
      {n:"破魔领域宝箱",q:12},
      {n:"蛛皇之血宝箱",q:8}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:5},
      {n:"极冰领域宝箱",q:7},
      {n:"海神领域宝箱",q:1},
      {n:"破魔领域宝箱",q:12},
      {n:"蛛皇之血宝箱",q:8}
    ]}
  ]},
  { server: "黄金·天使94服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:10,price:3},
      {n:"冰火之泉",q:100,price:0.1},
      {n:"唐门淬火石宝箱",q:33,price:0.3},
      {n:"昊天令礼包",q:105,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"深海沉银",q:56,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:52,price:1.5},
      {n:"蓝银之种",q:59,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:23}
    ]},
    { cat: "大奖", list: [
      {n:"死之乐章宝箱",q:6}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"剑痴领域宝箱",q:3},
      {n:"天梦领域宝箱",q:3},
      {n:"极冰领域宝箱",q:2},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:2}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"剑痴领域宝箱",q:3},
      {n:"天梦领域宝箱",q:3},
      {n:"极冰领域宝箱",q:2},
      {n:"死之乐章宝箱",q:6},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:4},
      {n:"蛛皇之血宝箱",q:2}
    ]}
  ]},
  { server: "黄金·天使96服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:9,price:3},
      {n:"冰火之泉",q:258,price:0.1},
      {n:"唐门淬火石宝箱",q:69,price:0.3},
      {n:"昊天令礼包",q:313,price:0.1},
      {n:"海神神装宝箱",q:2,price:3},
      {n:"至宝仙草礼包",q:41,price:1.5},
      {n:"蓝银之种",q:30,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
      {n:"蛛皇之血宝箱",q:1}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"蓝银之种宝箱10",q:3},
      {n:"蛛皇之血宝箱",q:1}
    ]}
  ]},
  { server: "黄金·天使97服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:16,price:3},
      {n:"冰火之泉",q:462,price:0.1},
      {n:"唐门淬火石宝箱",q:113,price:0.3},
      {n:"昊天令礼包",q:499,price:0.1},
      {n:"海神神装宝箱",q:14,price:3},
      {n:"深海沉银",q:32,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:56,price:1.5},
      {n:"蓝银之种",q:178,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:9}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:1},
      {n:"审判圣装宝箱",q:2},
      {n:"死之乐章宝箱",q:150},
      {n:"生灵守望宝匣",q:2}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:36},
      {n:"剑痴领域宝箱",q:33},
      {n:"天梦领域宝箱",q:36},
      {n:"极冰领域宝箱",q:79},
      {n:"海神领域宝箱",q:23},
      {n:"破魔领域宝箱",q:62},
      {n:"蛛皇之血宝箱",q:23}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:36},
      {n:"剑痴领域宝箱",q:33},
      {n:"天梦领域宝箱",q:36},
      {n:"极冰领域宝箱",q:79},
      {n:"死之乐章宝箱",q:150},
      {n:"海神领域宝箱",q:23},
      {n:"破魔领域宝箱",q:62},
      {n:"蓝银之种宝箱10",q:2},
      {n:"蛛皇之血宝箱",q:23}
    ]}
  ]},
  { server: "黄金·天使98服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:1,price:3},
      {n:"冰火之泉",q:11,price:0.1},
      {n:"至宝仙草礼包",q:4,price:1.5}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:1}
    ]},
    { cat: "大奖", list: [
      {n:"星神剑魂宝箱",q:2},
      {n:"死之乐章宝箱",q:1},
      {n:"龙皇神装宝箱",q:6}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:7},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:16},
      {n:"极冰领域宝箱",q:11},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:12}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:7},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:16},
      {n:"极冰领域宝箱",q:11},
      {n:"死之乐章宝箱",q:1},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:12}
    ]}
  ]},
  { server: "黄金·天使100服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:7,price:3},
      {n:"冰火之泉",q:325,price:0.1},
      {n:"唐门淬火石宝箱",q:108,price:0.3},
      {n:"昊天令礼包",q:447,price:0.1},
      {n:"海神神装宝箱",q:22,price:3},
      {n:"深海沉银",q:200,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:25,price:1.5},
      {n:"蓝银之种",q:175,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:44}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:62},
      {n:"审判圣装宝箱",q:21},
      {n:"死之乐章宝箱",q:6},
      {n:"生灵守望宝匣",q:38},
      {n:"罗刹神器选择宝箱",q:49},
      {n:"龙皇神装宝箱",q:25}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"剑痴领域宝箱",q:64},
      {n:"天梦领域宝箱",q:52},
      {n:"极冰领域宝箱",q:76},
      {n:"海神领域宝箱",q:35},
      {n:"蓝银之种宝箱2605",q:51},
      {n:"蛛皇之血宝箱",q:19}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"剑痴领域宝箱",q:64},
      {n:"天梦领域宝箱",q:52},
      {n:"极冰领域宝箱",q:76},
      {n:"死之乐章宝箱",q:6},
      {n:"海神领域宝箱",q:35},
      {n:"蓝银之种宝箱10",q:1},
      {n:"蛛皇之血宝箱",q:19}
    ]}
  ]},
  { server: "黄金·天使103服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:10,price:3},
      {n:"唐门淬火石宝箱",q:24,price:0.3},
      {n:"昊天令礼包",q:76,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:40,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:8,price:1.5},
      {n:"蓝银之种",q:47,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使104服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:4,price:3},
      {n:"唐门淬火石宝箱",q:28,price:0.3},
      {n:"昊天令礼包",q:78,price:0.1},
      {n:"海神神装宝箱",q:8,price:3},
      {n:"深海沉银",q:26,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:4,price:1.5},
      {n:"蓝银之种",q:49,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:7}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:22},
      {n:"死之乐章宝箱",q:17}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"剑痴领域宝箱",q:1},
      {n:"天梦领域宝箱",q:4},
      {n:"极冰领域宝箱",q:3},
      {n:"海神领域宝箱",q:2},
      {n:"破魔领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:43}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"剑痴领域宝箱",q:1},
      {n:"天梦领域宝箱",q:4},
      {n:"极冰领域宝箱",q:3},
      {n:"死之乐章宝箱",q:17},
      {n:"海神领域宝箱",q:2},
      {n:"破魔领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:43}
    ]}
  ]},
  { server: "黄金·天使105服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使106服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:4,price:0.1}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
      {n:"死之乐章宝箱",q:6}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"极冰领域宝箱",q:5},
      {n:"蛛皇之血宝箱",q:3}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:2},
      {n:"极冰领域宝箱",q:5},
      {n:"死之乐章宝箱",q:6},
      {n:"蛛皇之血宝箱",q:3}
    ]}
  ]},
  { server: "黄金·天使107服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:99,price:0.1},
      {n:"唐门淬火石宝箱",q:39,price:0.3},
      {n:"昊天令礼包",q:148,price:0.1},
      {n:"海神神装宝箱",q:13,price:3}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使108服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使110服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:17}
    ]},
    { cat: "大奖", list: [
      {n:"死之乐章宝箱",q:33},
      {n:"龙皇神装宝箱",q:15}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:9},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:11},
      {n:"极冰领域宝箱",q:12},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:21}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:9},
      {n:"剑痴领域宝箱",q:8},
      {n:"天梦领域宝箱",q:11},
      {n:"极冰领域宝箱",q:12},
      {n:"死之乐章宝箱",q:33},
      {n:"海神领域宝箱",q:7},
      {n:"破魔领域宝箱",q:8},
      {n:"蛛皇之血宝箱",q:21}
    ]}
  ]},
  { server: "黄金·天使111服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使112服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:4},
      {n:"生灵守望宝匣",q:4}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"天梦领域宝箱",q:1},
      {n:"蓝银之种宝箱2605",q:2},
      {n:"蛛皇之血宝箱",q:1}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:4},
      {n:"天梦领域宝箱",q:1},
      {n:"蛛皇之血宝箱",q:1}
    ]}
  ]},
  { server: "黄金·天使115服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使116服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:13,price:0.1}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使117服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:70,price:0.1},
      {n:"唐门淬火石宝箱",q:26,price:0.3},
      {n:"昊天令礼包",q:81,price:0.1},
      {n:"海神神装宝箱",q:3,price:3},
      {n:"深海沉银",q:35,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:32,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:6}
    ]},
    { cat: "大奖", list: [
      {n:"审判圣装宝箱",q:17},
      {n:"死之乐章宝箱",q:7},
      {n:"生灵守望宝匣",q:15},
      {n:"罗刹神器选择宝箱",q:9}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:3},
      {n:"剑痴领域宝箱",q:5},
      {n:"天梦领域宝箱",q:26},
      {n:"极冰领域宝箱",q:25},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:3},
      {n:"蓝银之种宝箱2605",q:25},
      {n:"蛛皇之血宝箱",q:4}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:3},
      {n:"剑痴领域宝箱",q:5},
      {n:"天梦领域宝箱",q:26},
      {n:"极冰领域宝箱",q:25},
      {n:"死之乐章宝箱",q:7},
      {n:"海神领域宝箱",q:4},
      {n:"破魔领域宝箱",q:3},
      {n:"蛛皇之血宝箱",q:4}
    ]}
  ]},
  { server: "黄金·天使118服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:27}
    ]},
    { cat: "大奖", list: [
      {n:"死之乐章宝箱",q:15}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:3},
      {n:"天梦领域宝箱",q:7},
      {n:"极冰领域宝箱",q:12},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:12},
      {n:"蛛皇之血宝箱",q:3}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:3},
      {n:"天梦领域宝箱",q:7},
      {n:"极冰领域宝箱",q:12},
      {n:"死之乐章宝箱",q:15},
      {n:"海神领域宝箱",q:3},
      {n:"破魔领域宝箱",q:12},
      {n:"蓝银之种宝箱10",q:14},
      {n:"蛛皇之血宝箱",q:3}
    ]}
  ]},
  { server: "黄金·天使119服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:10,price:0.1},
      {n:"唐门淬火石宝箱",q:3,price:0.3},
      {n:"昊天令礼包",q:11,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:2,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使120服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:135,price:0.1},
      {n:"唐门淬火石宝箱",q:40,price:0.3},
      {n:"昊天令礼包",q:210,price:0.1},
      {n:"海神神装宝箱",q:6,price:3},
      {n:"深海沉银",q:72,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:60,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:57}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:58},
      {n:"审判圣装宝箱",q:45},
      {n:"死之乐章宝箱",q:22},
      {n:"生灵守望宝匣",q:63},
      {n:"罗刹神器选择宝箱",q:33},
      {n:"龙皇神装宝箱",q:30}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:45},
      {n:"剑痴领域宝箱",q:52},
      {n:"天梦领域宝箱",q:79},
      {n:"极冰领域宝箱",q:55},
      {n:"海神领域宝箱",q:69},
      {n:"破魔领域宝箱",q:55},
      {n:"蓝银之种宝箱2605",q:52},
      {n:"蛛皇之血宝箱",q:97}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:45},
      {n:"剑痴领域宝箱",q:52},
      {n:"天梦领域宝箱",q:79},
      {n:"极冰领域宝箱",q:55},
      {n:"死之乐章宝箱",q:22},
      {n:"海神领域宝箱",q:69},
      {n:"破魔领域宝箱",q:55},
      {n:"蛛皇之血宝箱",q:97}
    ]}
  ]},
  { server: "黄金·天使121服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
    ]},
    { cat: "小奖（本月）", list: [
    ]},
    { cat: "小奖（历史）", list: [
    ]}
  ]},
  { server: "黄金·天使123服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:3,price:3},
      {n:"冰火之泉",q:79,price:0.1},
      {n:"唐门淬火石宝箱",q:26,price:0.3},
      {n:"昊天令礼包",q:114,price:0.1},
      {n:"海神神装宝箱",q:1,price:3},
      {n:"深海沉银",q:35,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:10,price:1.5},
      {n:"蓝银之种",q:45,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:7}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:78},
      {n:"审判圣装宝箱",q:65},
      {n:"死之乐章宝箱",q:41},
      {n:"生灵守望宝匣",q:64},
      {n:"罗刹神器选择宝箱",q:41},
      {n:"龙皇神装宝箱",q:110}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:105},
      {n:"剑痴领域宝箱",q:140},
      {n:"天梦领域宝箱",q:135},
      {n:"极冰领域宝箱",q:205},
      {n:"海神领域宝箱",q:57},
      {n:"破魔领域宝箱",q:150},
      {n:"蓝银之种宝箱2605",q:16},
      {n:"蛛皇之血宝箱",q:167}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:105},
      {n:"剑痴领域宝箱",q:140},
      {n:"天梦领域宝箱",q:135},
      {n:"极冰领域宝箱",q:205},
      {n:"死之乐章宝箱",q:41},
      {n:"海神领域宝箱",q:57},
      {n:"破魔领域宝箱",q:150},
      {n:"蛛皇之血宝箱",q:167}
    ]}
  ]},
  { server: "黄金·天使125服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:11,price:3},
      {n:"唐门淬火石宝箱",q:15,price:0.3},
      {n:"昊天令礼包",q:154,price:0.1},
      {n:"海神神装宝箱",q:7,price:3},
      {n:"至宝仙草礼包",q:32,price:1.5},
      {n:"蓝银之种",q:78,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:38},
      {n:"审判圣装宝箱",q:43},
      {n:"死之乐章宝箱",q:14},
      {n:"生灵守望宝匣",q:50},
      {n:"罗刹神器选择宝箱",q:48},
      {n:"龙皇神装宝箱",q:167}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:99},
      {n:"剑痴领域宝箱",q:110},
      {n:"天梦领域宝箱",q:117},
      {n:"极冰领域宝箱",q:147},
      {n:"海神领域宝箱",q:82},
      {n:"破魔领域宝箱",q:161},
      {n:"蓝银之种宝箱2605",q:69},
      {n:"蛛皇之血宝箱",q:157}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:99},
      {n:"剑痴领域宝箱",q:110},
      {n:"天梦领域宝箱",q:117},
      {n:"极冰领域宝箱",q:147},
      {n:"死之乐章宝箱",q:14},
      {n:"海神领域宝箱",q:82},
      {n:"破魔领域宝箱",q:161},
      {n:"蓝银之种宝箱10",q:52},
      {n:"蛛皇之血宝箱",q:157}
    ]}
  ]},
  { server: "黄金·天使126服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:6,price:3},
      {n:"冰火之泉",q:533,price:0.1},
      {n:"唐门淬火石宝箱",q:201,price:0.3},
      {n:"昊天令礼包",q:786,price:0.1},
      {n:"海神神装宝箱",q:77,price:3},
      {n:"深海沉银",q:329,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:14,price:1.5},
      {n:"蓝银之种",q:275,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:24}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:8},
      {n:"审判圣装宝箱",q:58},
      {n:"生灵守望宝匣",q:46},
      {n:"罗刹神器选择宝箱",q:44},
      {n:"龙皇神装宝箱",q:36}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:42},
      {n:"剑痴领域宝箱",q:75},
      {n:"天梦领域宝箱",q:28},
      {n:"极冰领域宝箱",q:24},
      {n:"海神领域宝箱",q:29},
      {n:"破魔领域宝箱",q:24},
      {n:"蛛皇之血宝箱",q:97}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:42},
      {n:"剑痴领域宝箱",q:75},
      {n:"天梦领域宝箱",q:28},
      {n:"极冰领域宝箱",q:24},
      {n:"海神领域宝箱",q:29},
      {n:"破魔领域宝箱",q:24},
      {n:"蛛皇之血宝箱",q:97}
    ]}
  ]},
  { server: "黄金·天使127服", group: "天使黄金", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:8,price:3},
      {n:"冰火之泉",q:154,price:0.1},
      {n:"唐门淬火石宝箱",q:36,price:0.3},
      {n:"昊天令礼包",q:220,price:0.1},
      {n:"海神神装宝箱",q:7,price:3},
      {n:"深海沉银",q:87,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:65,price:1.5},
      {n:"蓝银之种",q:111,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:5}
    ]},
    { cat: "大奖", list: [
      {n:"生灵守望宝匣",q:3},
      {n:"罗刹神器选择宝箱",q:2}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:7},
      {n:"极冰领域宝箱",q:3},
      {n:"海神领域宝箱",q:14},
      {n:"蓝银之种宝箱2605",q:21},
      {n:"蛛皇之血宝箱",q:16}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:8},
      {n:"剑痴领域宝箱",q:7},
      {n:"天梦领域宝箱",q:7},
      {n:"极冰领域宝箱",q:3},
      {n:"海神领域宝箱",q:14},
      {n:"蛛皇之血宝箱",q:16}
    ]}
  ]},
  { server: "黄金·天使128服", group: "天使黄金", items: [
    { cat: "背包", list: [
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱（2605）",q:142}
    ]},
    { cat: "大奖", list: [
      {n:"龙皇神装宝箱",q:59}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:18},
      {n:"剑痴领域宝箱",q:14},
      {n:"天梦领域宝箱",q:14},
      {n:"极冰领域宝箱",q:29},
      {n:"海神领域宝箱",q:9},
      {n:"破魔领域宝箱",q:20},
      {n:"蛛皇之血宝箱",q:30}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:18},
      {n:"剑痴领域宝箱",q:14},
      {n:"天梦领域宝箱",q:14},
      {n:"极冰领域宝箱",q:29},
      {n:"海神领域宝箱",q:9},
      {n:"破魔领域宝箱",q:20},
      {n:"蛛皇之血宝箱",q:30}
    ]}
  ]},
  { server: "神龍界域", group: "神龍界域", items: [
    { cat: "背包", list: [
      {n:"仙草皇礼包",q:45,price:3},
      {n:"冰火之泉",q:97,price:0.1},
      {n:"唐门淬火石宝箱",q:157,price:0.3},
      {n:"昊天令礼包",q:736,price:0.1},
      {n:"海神神装宝箱",q:14,price:3},
      {n:"深海沉银",q:24,price:1,bp:0.8,bq:100},
      {n:"至宝仙草礼包",q:163,price:1.5},
      {n:"蓝银之种",q:77,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:91},
      {n:"雪茄选择宝箱（2605）",q:136}
    ]},
    { cat: "大奖", list: [
      {n:"典藏魂卡选择宝箱",q:13},
      {n:"圣相宝匣",q:31},
      {n:"审判圣装宝箱",q:5},
      {n:"星神剑魂宝箱",q:117},
      {n:"死之乐章宝箱",q:194},
      {n:"生灵守望宝匣",q:3},
      {n:"赤焱龙心宝箱",q:41}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:221},
      {n:"剑痴领域宝箱",q:131},
      {n:"天梦领域宝箱",q:178},
      {n:"极冰领域宝箱",q:219},
      {n:"海神领域宝箱",q:329},
      {n:"破魔领域宝箱",q:194},
      {n:"蓝银之种宝箱2605",q:26},
      {n:"蛛皇之血宝箱",q:428}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:221},
      {n:"剑痴领域宝箱",q:131},
      {n:"天梦领域宝箱",q:178},
      {n:"极冰领域宝箱",q:219},
      {n:"死之乐章宝箱",q:194},
      {n:"海神领域宝箱",q:329},
      {n:"破魔领域宝箱",q:194},
      {n:"蓝银之种宝箱1",q:25},
      {n:"蓝银之种宝箱5",q:13},
      {n:"蛛皇之血宝箱",q:428}
    ]}
  ]},
  { server: "诸天万域", group: "诸天万域", items: [
    { cat: "背包", list: [
      {n:"冰火之泉",q:9,price:0.1},
      {n:"唐门淬火石宝箱",q:5,price:0.3},
      {n:"昊天令礼包",q:24,price:0.1},
      {n:"深海沉银",q:6,price:1,bp:0.8,bq:100},
      {n:"蓝银之种",q:2,price:1,bp:0.8,bq:100}
    ]},
    { cat: "雪茄", list: [
      {n:"雪茄选择宝箱1",q:12},
      {n:"雪茄选择宝箱3",q:8},
      {n:"雪茄选择宝箱4",q:38},
      {n:"雪茄选择宝箱（2605）",q:8}
    ]},
    { cat: "大奖", list: [
      {n:"修罗宝箱(2025)",q:3},
      {n:"星光翎羽宝箱",q:1},
      {n:"赤焱龙心宝箱",q:1},
      {n:"龙纹琉璃宝箱",q:16}
    ]},
    { cat: "小奖（本月）", list: [
      {n:"七杀领域宝箱",q:16},
      {n:"暗月领域宝箱",q:8},
      {n:"极冰领域宝箱",q:11},
      {n:"蛛皇之血宝箱",q:61}
    ]},
    { cat: "小奖（历史）", list: [
      {n:"七杀领域宝箱",q:16},
      {n:"天使至尊礼包",q:5},
      {n:"天使豪华礼包",q:17},
      {n:"暗月领域宝箱",q:8},
      {n:"极冰领域宝箱",q:11},
      {n:"蓝银之种宝箱8",q:2},
      {n:"蛛皇之血宝箱",q:61}
    ]}
  ]}
];;
